exercise-optimisation/step1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          22;
        startFace       10170;
    }
    outlet
    {
        type            patch;
        nFaces          22;
        startFace       10192;
    }
    wallUpper
    {
        type            wall;
        inGroups        1(wall);
        nFaces          256;
        startFace       10214;
    }
    wallLower
    {
        type            wall;
        inGroups        1(wall);
        nFaces          264;
        startFace       10470;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5144;
        startFace       10734;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5144;
        startFace       15878;
    }
)

// ************************************************************************* //
